# Time Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Time Property
SpecTypeId Class See Also
---
Time, in discipline Common.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Time { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Time As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Time {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace